Portfolio_backend/app/controllers/application_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def sign_up
    user = User.new(sign_up_params)
    if user.save