Portfolio_backend/app/controllers/companies_controller.rb

  def index
    if params[:query]
      @companies = Company.where('company_name LIKE ?', "%#{params[:query]}%")
    else
      @companies = Company.all
---
SELECT "companies".* FROM "companies" WHERE (company_name LIKE '%hh%')

  def show
    @company = Company.includes(:earnings).find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "earnings".* FROM "earnings" WHERE "earnings"."company_id" = ?  [["company_id", 1]]

  def create
    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("company_code", "listing_status", "company_name", "company_name_kana", "mail_address", "address", "representative", "representative_kana", "phone_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @company.update(company_params)
---
UPDATE "companies" SET "company_name" = ?, "mail_address" = ?, "phone_number" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["company_name", "今野商事"], ["mail_address", "689@1221"], ["phone_number", "0857-04-130"], ["updated_at", "2023-08-16 08:15:27.809296"], ["id", 1]]

  def destroy
    @company.destroy
---
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 102]]

  def set_company
    @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]