Portfolio_backend/app/controllers/earnings_controller.rb

SELECT "earnings".* FROM "earnings"
---
   def index
     # 年度ごとの平均を計算
     avg_earnings_2020 = Earning.average(:earnings_2020).to_f
     avg_profit_2020 = Earning.average(:profit_2020).to_f

     avg_earnings_2021 = Earning.average(:earnings_2021).to_f
     avg_profit_2021 = Earning.average(:profit_2021).to_f

     avg_earnings_2022 = Earning.average(:earnings_2022).to_f
     avg_profit_2022 = Earning.average(:profit_2022).to_f