Portfolio_backend/app/controllers/posts_controller.rb

    def create
        post = Post.new(post_params)
        if post.save
---
INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "jjj"], ["created_at", "2023-08-10 13:21:25.493486"], ["updated_at", "2023-08-10 13:21:25.493486"]]